package com.domain.lesson5.Library;

//public class ClassOOP {
//    public static void main(String[] args) {
        /* программы Java состоят из совокупности объектов, при этом каждый объект экземпляр класса

        1. на концептуальном уровне
        выделяем объекты и связи между ними
        каждый тип объекта делает что-то свое в программе (имеет свою сферу в программе)

        2. описываем классы
        -перечисляем свойства  и методы

        3. создание объектов в программе



         */

        // система учета книг в библиотеке
        // для каждой книге д.б указано:
        //   -автор
        //   -название
        //   -можно ли брать домой (или только в читальном зале)
        //   -доступна для выдачи или нет
        // книги хранятся в библиотеке
        // в библиотеку можно добавить одну книгу
        // в библиотеку можно добавить сразу несколько книг
        // должна быть возможность получить информацию по книге  указав ее название
        // (получаемая информация: автор, название, можно ли взять ее домой, доступна ли книга )
        // если книга не найдена- сообщение, что книги нет
        // д.б. возможность взять книгу домой, указав название
        // д.б. возможность прочитать книгу в читальном зале, указав название




//    }
//}
